Step 1: Import the Required Libraries

In [13]:
import pandas as pd 
import numpy as np

Step 2: Load the Dataset

In [28]:
df = pd.read_csv('sample_data.csv')

Step 3: Explore the Dataset

In [29]:
df.head()
# df.shape
# df.dtypes

   Employee_ID             Name   Age  Salary Department
0            1       John Smith  32.0  5000.0         HR
1            2         Jane Doe  28.0     NaN  Marketing
2            3  Michael Johnson  35.0  5500.0         IT
3            4   Sarah Thompson   NaN  4500.0    Finance
4            5        David Lee  40.0  6000.0         IT

Step 4: Handle Missing Data

In [25]:
df.isnull().sum()

# Drop rows with missing values
df = df.dropna()

# Impute missing values (example: using mean)
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

Employee_ID    0
Name           0
Age            1
Salary         1
Department     0
dtype: int64

Step 5: Handle Duplicate Data

In [35]:
# Check for duplicate rows
print("Duplicate Rows:", df.duplicated().sum())

# Drop duplicate rows
df = df.drop_duplicates()

# Display the resulting DataFrame without duplicates
df

Duplicate Rows: 0

   Employee_ID             Name   Age  Salary Department
0            1       John Smith  32.0  5000.0         HR
1            2         Jane Doe  28.0  5250.0  Marketing
2            3  Michael Johnson  35.0  5500.0         IT
3            4   Sarah Thompson   NaN  4500.0    Finance
4            5        David Lee  40.0  6000.0         IT

Step 6: Handle Outliers

Step 7: Data Formatting

In [34]:
# Convert 'Age' column to integer data type
df['Age'] = df['Age'].astype(int)

Step 8: Data Transformation

In [ ]:
# Apply mathematical operation to 'Salary' column
df['Salary'] = df['Salary'] * 1.1  # Example: increase salary by 10%

# Perform one-hot encoding for categorical variable 'Department'
df = pd.get_dummies(df, columns=['Department'])

Step 9: Export the Cleaned Dataset

In [ ]:
df.to_csv('cleaned_employee_records.csv', index=False)